Revit 2020 API
LabelUtils.GetLabelFor Method (UnitSymbolType)
 Gets the user-visible name for a UnitSymbolType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public static string GetLabelFor(
	UnitSymbolType unitSymbolType
)
Visual Basic
Public Shared Function GetLabelFor ( _
	unitSymbolType As UnitSymbolType _
) As String
Visual C++
public:
static String^ GetLabelFor(
	UnitSymbolType unitSymbolType
)
Parameters
unitSymbolType
Type: Autodesk.Revit.DB.UnitSymbolType
 The UnitSymbolType to get the user-visible name.
Remarks
 The name is obtained in the current Revit language.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  UnitSymbolType cannot be None.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace